OdRxDescriptionAttribute.sourceHint
\details
Gets the description string resource identifier hint.
\returns
Description string resource identifier hint. Zero if the string resource identifier hint is not set.

OdRxDescriptionAttribute.id
\details
Gets the description string resource identifier.
\returns
Description string resource identifier.

OdRxDescriptionAttribute.getDescription(OdRxObject!System.Runtime.CompilerServices.IsConst*)
\details
Looks up OdRxDescriptionAttribute on the object if it is a member, (and in
the object class attribute list if it is not), and uses OdRxResourceLoader
to get the string from resources identified by ID and hint.
\param pO [in]  Object to be queried for a description.
\returns
A description string if found; empty string otherwise.

OdRxDescriptionAttribute.createObject(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt32,System.UInt32)
\details
Constructor. Creates an attribute to store a description string resource ID
and a resource ID hint.
\param description [in]  Description string.
\param id          [in]  Resource ID of the string.
\param sourceHint  [in]  Resource ID hint.
\returns
Smart pointer to a constructed attribute object.